# -*- coding: utf-8 -*-
"""
Created on Sun Nov 19 01:36:21 2017

author: Maria Zorkaltseva
"""

# Формат ввода
# Вводится целое неотрицательное число N. N≤100.
# Формат вывода
# Выведите 2ᴺ.

N = int(input())
print(2 ** N)
