# -*- coding: utf-8 -*-
"""
Created on Sun Nov 19 02:05:18 2017

author: Maria Zorkaltseva
"""

#Дано двузначное число. Найдите число десятков в нем.
#Формат ввода
#Вводится единственное число 
#(гарантируется, что оно соответствует условию задачи).
# Формат вывода
# Выведите ответ на задачу

n = int(input())
print(n // 10)
